Revit 2027 API
ParameterTypeId.RbsPipeClassParam Property
 "Schedule/Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsPipeClassParam { get; }
Public Shared ReadOnly Property RbsPipeClassParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsPipeClassParam {
	ForgeTypeId^ get ();
}
static member RbsPipeClassParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace